БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>Skype</name>
      <description>Skype</description>
    </items>
    <items>
      <name>АдресИностранный</name>
      <description>Адрес за пределами РФ</description>
    </items>
    <items>
      <name>АдресМестаРождения</name>
      <description>Адрес места рождения</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыДомашний</name>
      <description>Адрес электронной почты (личный)</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыРабочий</name>
      <description>Адрес электронной почты (рабочий)</description>
    </items>
    <items>
      <name>ВебСтраницаОрганизации</name>
      <description>Веб-страница организации</description>
    </items>
    <items>
      <name>ТелефонДомашний</name>
      <description>Домашний телефон</description>
    </items>
    <items>
      <name>ВебСтраницаФизЛица</name>
      <description>Домашняя веб-страница</description>
    </items>
    <items>
      <name>НомерПрочий</name>
      <description>Номер прочий</description>
    </items>
    <items>
      <name>АдресПочтовый</name>
      <description>Почтовый адрес</description>
    </items>
    <items>
      <name>ПрочаяИнформация</name>
      <description>Прочая информация</description>
    </items>
    <items>
      <name>ТелефонРабочий</name>
      <description>Рабочий телефон</description>
    </items>
    <items>
      <name>ТелефонСотовый</name>
      <description>Сотовый телефон</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ТелефонОрганизации</name>
      <description>Телефон организации</description>
    </items>
    <items>
      <name>Факс</name>
      <description>Факс</description>
    </items>
    <items>
      <name>АдресФактический</name>
      <description>Фактический адрес</description>
    </items>
    <items>
      <name>АдресЮридический</name>
      <description>Юридический адрес (адрес регистрации)</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <comment>Тип контактной информации</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаскуВвода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаВводаТелефонногоНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <comment>Не используется</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <comment>Не используется</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактируетсяВФормеОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/НазначениеКонтактнойИнформации/НазначениеКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НазначениеКонтактнойИнформации</name>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <comment>Типы контактной информации</comment>
  <enumValues>
    <name>Телефон</name>
    <comment>Телефон</comment>
  </enumValues>
  <enumValues>
    <name>Адрес</name>
    <comment>Адрес</comment>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <comment>E-Mail</comment>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <comment>Веб-страница</comment>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <comment>Другая контактная информация (произвольная)</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыКонтактнойИнформации/Forms/ФормаЭлементаУпр/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Тип) Тогда
		Элементы.Тип.Доступность = Ложь;
	Иначе
		Элементы.Тип.Доступность = Истина;
	КонецЕсли;
	
	ОбновитьТаблицуНазначенийКИ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ИспользоватьМаскуВвода И Не ЗначениеЗаполнено(Объект.МаскаВводаТелефонногоНомера) Тогда 
		ПоказатьПредупреждение(,НСтр("ru='При использовании ввода по маске необходимо заполнить маску ввода!'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Запись назначений КИ
	НЗНазначения = РегистрыСведений.НазначениеКонтактнойИнформации.СоздатьНаборЗаписей();
	НЗНазначения.Отбор.Вид.Установить(Объект.Ссылка);
	Для Каждого элСписка Из НазначениеКонтактнойИнформации Цикл
		Если элСписка.Пометка Тогда
			Запись = НЗНазначения.Добавить();
			Запись.Вид = Объект.Ссылка;
			Запись.ИмяМетаданных = элСписка.Значение;
		КонецЕсли;
	КонецЦикла;
	НЗНазначения.Записать();
	
	ОбновитьТаблицуНазначенийКИ();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ВидКонтактнойИнформацииИзменение", Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
	Если (Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")
		Или Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Другое"))
	Тогда
		Объект.РедактируетсяВФормеОбъекта = Истина;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		Объект.РедактируетсяВФормеОбъекта = Ложь
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМаскуВводаПриИзменении(Элемент)
	НастроитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправкуМаскаВвода(Команда)
	
	ТекстСправки = НСтр("ru='Маска ввода содержит посимвольную строку маски интерактивного ввода текста в поле.
					|В строке маски допустимо использование следующих специальных символов: 
					|! - любой введенный символ преобразуется в верхний регистр; 
					|9 - допустимо ввести произвольный символ цифры; 
					|# - допустимо ввести произвольный символ цифры или - (знак минус) или + (знак плюс) или пробел; 
					|N - допустимо ввести любые алфавитно-цифровые символы (буквы или цифры); 
					|U - допустимо ввести любые алфавитно-цифровые символы (буквы или цифры) и любой введенный символ преобразуется в верхний регистр; 
					|X (латинского алфавита) - допустимо ввести произвольный символ; 
					|^ - недопустимо вводить этот символ интерактивно пользователем, он может устанавливаться только из языка; 
					|h - допустим ввод символов обозначения шестнадцатеричных цифр; 
					|@ – допустимо ввести любые алфавитно-цифровые символы (буквы или цифры) в верхнем регистре или пробел.'");
	ПоказатьПредупреждение(,ТекстСправки, 60, НСтр("ru='Формат маски ввода в 1С'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьТаблицуНазначенийКИ()
	
	Элементы.НазначениеКонтактнойИнформации.ТолькоПросмотр = Объект.Ссылка.Пустая();

	// Заполнение списка назначений КИ
	мсНазначенияВидовКонтактнойИнфомрации = КонтактнаяИнформацияСервер.ПолучитьНазначенияВидовКонтактнойИнфомрации();
	
	НЗНазначения = РегистрыСведений.НазначениеКонтактнойИнформации.СоздатьНаборЗаписей();
	Если Не Объект.Ссылка.Пустая() Тогда
		НЗНазначения.Отбор.Вид.Установить(Объект.Ссылка);
		НЗНазначения.Прочитать();
	КонецЕсли;
	ТЗНазначения = НЗНазначения.Выгрузить();
	
	НазначениеКонтактнойИнформации.Очистить();
	Для Каждого НазначениеКИ Из мсНазначенияВидовКонтактнойИнфомрации Цикл
		
		элСписка = НазначениеКонтактнойИнформации.Добавить();
		элСписка.Значение		= НазначениеКИ.Имя;
		элСписка.Представление	= НазначениеКИ.Синоним;
		элСписка.Пометка		= ТЗНазначения.Найти(НазначениеКИ.Имя) <> Неопределено;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	Элементы.ГруппаМаска.Доступность = (Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	Элементы.МаскаВводаТелефонногоНомера.Доступность = Объект.ИспользоватьМаскуВвода;
	
	ЭтоАдрес = (Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	Элементы.МеждународныйФорматАдреса.Доступность = ЭтоАдрес;
	Элементы.РедактируетсяВФормеОбъекта.Доступность = Не ЭтоАдрес;
	
КонецПроцедуры
		
#КонецОбласти
